RT-Thread/rt-thread/bsp/stm32/libraries/STM32G4xx_HAL/STM32G4xx_HAL_Driver/Inc/stm32g4xx_ll_rtc.h
/** @defgroup RTC_LL_EC_TAMPER_DURATION  TAMPER DURATION
  * @{
  */
#define LL_RTC_TAMPER_DURATION_1RTCCLK     0x00000000U            /*!< Tamper pins are pre-charged before sampling during 1 RTCCLK cycle  */
#define LL_RTC_TAMPER_DURATION_2RTCCLK     TAMP_FLTCR_TAMPPRCH_0  /*!< Tamper pins are pre-charged before sampling during 2 RTCCLK cycles */
#define LL_RTC_TAMPER_DURATION_4RTCCLK     TAMP_FLTCR_TAMPPRCH_1  /*!< Tamper pins are pre-charged before sampling during 4 RTCCLK cycles */
#define LL_RTC_TAMPER_DURATION_8RTCCLK     TAMP_FLTCR_TAMPPRCH    /*!< Tamper pins are pre-charged before sampling during 8 RTCCLK cycles */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_TAMPER_FILTER  TAMPER FILTER
  * @{
  */
#define LL_RTC_TAMPER_FILTER_DISABLE       0x00000000U             /*!< Tamper filter is disabled */
#define LL_RTC_TAMPER_FILTER_2SAMPLE       TAMP_FLTCR_TAMPFLT_0    /*!< Tamper is activated after 2 consecutive samples at the active level */
#define LL_RTC_TAMPER_FILTER_4SAMPLE       TAMP_FLTCR_TAMPFLT_1    /*!< Tamper is activated after 4 consecutive samples at the active level */
#define LL_RTC_TAMPER_FILTER_8SAMPLE       TAMP_FLTCR_TAMPFLT      /*!< Tamper is activated after 8 consecutive samples at the active level. */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_TAMPER_SAMPLFREQDIV  TAMPER SAMPLING FREQUENCY DIVIDER
  * @{
  */
#define LL_RTC_TAMPER_SAMPLFREQDIV_32768   0x00000000U                                     /*!< Each of the tamper inputs are sampled with a frequency =  RTCCLK / 32768 */
#define LL_RTC_TAMPER_SAMPLFREQDIV_16384   TAMP_FLTCR_TAMPFREQ_0                           /*!< Each of the tamper inputs are sampled with a frequency =  RTCCLK / 16384 */
#define LL_RTC_TAMPER_SAMPLFREQDIV_8192    TAMP_FLTCR_TAMPFREQ_1                           /*!< Each of the tamper inputs are sampled with a frequency =  RTCCLK / 8192 */
#define LL_RTC_TAMPER_SAMPLFREQDIV_4096    (TAMP_FLTCR_TAMPFREQ_1 | TAMP_FLTCR_TAMPFREQ_0) /*!< Each of the tamper inputs are sampled with a frequency =  RTCCLK / 4096 */
#define LL_RTC_TAMPER_SAMPLFREQDIV_2048    TAMP_FLTCR_TAMPFREQ_2                           /*!< Each of the tamper inputs are sampled with a frequency =  RTCCLK / 2048 */
#define LL_RTC_TAMPER_SAMPLFREQDIV_1024    (TAMP_FLTCR_TAMPFREQ_2 | TAMP_FLTCR_TAMPFREQ_0) /*!< Each of the tamper inputs are sampled with a frequency =  RTCCLK / 1024 */
#define LL_RTC_TAMPER_SAMPLFREQDIV_512     (TAMP_FLTCR_TAMPFREQ_2 | TAMP_FLTCR_TAMPFREQ_1) /*!< Each of the tamper inputs are sampled with a frequency =  RTCCLK / 512 */
#define LL_RTC_TAMPER_SAMPLFREQDIV_256     TAMP_FLTCR_TAMPFREQ                             /*!< Each of the tamper inputs are sampled with a frequency =  RTCCLK / 256 */
/**
  * @}
  */

/** @defgroup RTC_LL_EC_TAMPER_ACTIVELEVEL  TAMPER ACTIVE LEVEL
  * @{
  */
#define LL_RTC_TAMPER_ACTIVELEVEL_TAMP1    TAMP_CR2_TAMP1TRG /*!< Tamper 1 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_RTC_TAMPER_ACTIVELEVEL_TAMP2    TAMP_CR2_TAMP2TRG /*!< Tamper 2 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#if (RTC_TAMP_NB == 3)
#define LL_RTC_TAMPER_ACTIVELEVEL_TAMP3    TAMP_CR2_TAMP3TRG /*!< Tamper 3 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#elif (RTC_TAMP_NB == 8)
#define LL_RTC_TAMPER_ACTIVELEVEL_TAMP3    TAMP_CR2_TAMP3TRG /*!< Tamper 3 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_RTC_TAMPER_ACTIVELEVEL_TAMP4    TAMP_CR2_TAMP4TRG /*!< Tamper 4 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_RTC_TAMPER_ACTIVELEVEL_TAMP5    TAMP_CR2_TAMP5TRG /*!< Tamper 5 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_RTC_TAMPER_ACTIVELEVEL_TAMP6    TAMP_CR2_TAMP6TRG /*!< Tamper 6 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_RTC_TAMPER_ACTIVELEVEL_TAMP7    TAMP_CR2_TAMP7TRG /*!< Tamper 7 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#define LL_RTC_TAMPER_ACTIVELEVEL_TAMP8    TAMP_CR2_TAMP8TRG /*!< Tamper 8 input falling edge (if TAMPFLT = 00) or staying high (if TAMPFLT != 00) triggers a tamper detection event */
#endif /* (RTC_TAMP_NB) */
/**
  * @}
  */


/** @defgroup RTC_LL_EC_INTERNAL  INTERNAL TAMPER
  * @{
  */
#define LL_RTC_TAMPER_ITAMP1           TAMP_CR1_ITAMP1E /*!< Internal tamper 1: RTC supply voltage monitoring */
#if defined (RTC_TAMP_INT_2_SUPPORT)
#define LL_RTC_TAMPER_ITAMP2           TAMP_CR1_ITAMP2E /*!< Internal tamper 2: temperature monitoring */
#endif /* RTC_TAMP_INT_2_SUPPORT */
#define LL_RTC_TAMPER_ITAMP3           TAMP_CR1_ITAMP3E /*!< Internal tamper 3: LSE monitoring */
#define LL_RTC_TAMPER_ITAMP4           TAMP_CR1_ITAMP4E /*!< Internal tamper 4: HSE monitoring */
#define LL_RTC_TAMPER_ITAMP5           TAMP_CR1_ITAMP5E /*!< Internal tamper 5: RTC calendar overflow */
#if defined (RTC_TAMP_INT_6_SUPPORT)
#define LL_RTC_TAMPER_ITAMP6           TAMP_CR1_ITAMP6E /*!< Internal tamper 6: Test mode entry */
#endif /* RTC_TAMP_INT_6_SUPPORT */
#if defined (RTC_TAMP_INT_7_SUPPORT)
#define LL_RTC_TAMPER_ITAMP7           TAMP_CR1_ITAMP7E /*!< Internal tamper 7: Readout protection level decrease */
#endif /* RTC_TAMP_INT_7_SUPPORT */
#if defined (RTC_TAMP_INT_8_SUPPORT)
#define LL_RTC_TAMPER_ITAMP8           TAMP_CR1_ITAMP8E /*!< Internal tamper 8: Monotonic counter overflow */
#endif /* RTC_TAMP_INT_8_SUPPORT */

/**
  * @}
  */

/** @defgroup RTC_LL_EC_BKP  BACKUP
  * @{
  */
#define LL_RTC_BKP_NUMBER                    RTC_BACKUP_NB
#if (LL_RTC_BKP_NUMBER == 5)
#define LL_RTC_BKP_DR0                       0x00U
#define LL_RTC_BKP_DR1                       0x01U
#define LL_RTC_BKP_DR2                       0x02U
#define LL_RTC_BKP_DR3                       0x03U
#define LL_RTC_BKP_DR4                       0x04U
#elif (LL_RTC_BKP_NUMBER == 16)
#define LL_RTC_BKP_DR0                       0x00U
#define LL_RTC_BKP_DR1                       0x01U
#define LL_RTC_BKP_DR2                       0x02U
#define LL_RTC_BKP_DR3                       0x03U
#define LL_RTC_BKP_DR4                       0x04U
#define LL_RTC_BKP_DR5                       0x05U
#define LL_RTC_BKP_DR6                       0x06U
#define LL_RTC_BKP_DR7                       0x07U
#define LL_RTC_BKP_DR8                       0x08U
#define LL_RTC_BKP_DR9                       0x09U
#define LL_RTC_BKP_DR10                      0x0AU
#define LL_RTC_BKP_DR11                      0x0BU
#define LL_RTC_BKP_DR12                      0x0CU
#define LL_RTC_BKP_DR13                      0x0DU
#define LL_RTC_BKP_DR14                      0x0EU
#define LL_RTC_BKP_DR15                      0x0FU
#elif (LL_RTC_BKP_NUMBER == 32)
#define LL_RTC_BKP_DR0                       0x00U
#define LL_RTC_BKP_DR1                       0x01U
#define LL_RTC_BKP_DR2                       0x02U
#define LL_RTC_BKP_DR3                       0x03U
#define LL_RTC_BKP_DR4                       0x04U
#define LL_RTC_BKP_DR5                       0x05U
#define LL_RTC_BKP_DR6                       0x06U
#define LL_RTC_BKP_DR7                       0x07U
#define LL_RTC_BKP_DR8                       0x08U
#define LL_RTC_BKP_DR9                       0x09U
#define LL_RTC_BKP_DR10                      0x0AU
#define LL_RTC_BKP_DR11                      0x0BU
#define LL_RTC_BKP_DR12                      0x0CU
#define LL_RTC_BKP_DR13                      0x0DU
#define LL_RTC_BKP_DR14                      0x0EU
#define LL_RTC_BKP_DR15                      0x0FU
#define LL_RTC_BKP_DR16                      0x10U
#define LL_RTC_BKP_DR17                      0x11U
#define LL_RTC_BKP_DR18                      0x12U
#define LL_RTC_BKP_DR19                      0x13U
#define LL_RTC_BKP_DR20                      0x14U
#define LL_RTC_BKP_DR21                      0x15U
#define LL_RTC_BKP_DR22                      0x16U
#define LL_RTC_BKP_DR23                      0x17U
#define LL_RTC_BKP_DR24                      0x18U
#define LL_RTC_BKP_DR25                      0x19U
#define LL_RTC_BKP_DR26                      0x1AU
#define LL_RTC_BKP_DR27                      0x1BU
#define LL_RTC_BKP_DR28                      0x1CU
#define LL_RTC_BKP_DR29                      0x1DU
#define LL_RTC_BKP_DR30                      0x1EU
#define LL_RTC_BKP_DR31                      0x1FU
#else
#error "no LL Backup Registers Definition"
#endif /* (LL_RTC_BKP_NUMBER) */

/**
  * @}
  */

